Repository: FELTRINCyril/Muscu
Catalog: App/Resources/Localizable.xcstrings
Source language: fr
Languages: en

# %@ %lld sur 5
source: %1$@ %2$lld sur 5
en: %@ %lld of 5

# %@ %lld séries
source: %1$@ %2$lld séries
en: %@ %lld sets

# %@ (%lld série(s))
source: %1$@ (%2$lld série(s))
en: %@ (%lld set(s))

# %@ / %@ bpm
source: %1$@ / %2$@ bpm
en: %@ / %@ bpm

# %@ : %lld → %lld séries
source: %1$@ : %2$lld → %3$lld séries
en: %@: %lld → %lld sets

source: %@ : déplacé
en: %@: moved

source: %@ de tonnage
en: %@ of tonnage

# %@ en %@
source: %1$@ en %2$@
en: %@ in %@

# %@ kg -> %@ kg
source: %1$@ kg -> %2$@ kg
en: %@ kg -> %@ kg

# %@ kg x %lld
source: %1$@ kg x %2$lld
en: %@ kg x %lld

# %@ kg × %lld
source: %1$@ kg × %2$lld
en: %@ kg × %lld

# %@ le %@
source: %1$@ le %2$@
en: %@ on %@

source: %@ reps par tour
en: %@ reps per round

source: %@ répétitions
en: %@ reps

# %@ x %lld
source: %1$@ x %2$lld
en: %@ x %lld

# %@ · %lld ms · %lld correction(s)
source: %1$@ · %2$lld ms · %3$lld correction(s)
en: %@ · %lld ms · %lld repair(s)

# %@ · %lld série(s)
source: %1$@ · %2$lld série(s)
en: %@ · %lld set(s)

# %@ · série %lld/%lld
source: %1$@ · série %2$lld/%3$lld
en: %@ · set %lld/%lld

# %@ × le poids de corps (%@)
source: %1$@ × le poids de corps (%2$@)
en: %@ × body weight (%@)

# %@ — 1RM estimé %@ (avant %@)
source: %1$@ — 1RM estimé %2$@ (avant %3$@)
en: %@ — estimated 1RM %@ (was %@)

# %@ — charge %@ (avant %@)
source: %1$@ — charge %2$@ (avant %3$@)
en: %@ — load %@ (was %@)

# %@ → %@ (%@%lld j)
source: %1$@ → %2$@ (%3$@%4$lld j)
en: %@ → %@ (%@%lld d)

# %@, %@ répétitions
source: %1$@, %2$@ répétitions
en: %@, %@ reps

# %@, tour %lld sur %lld, exercice %lld sur %lld : %@
source: %1$@, tour %2$lld sur %3$lld, exercice %4$lld sur %5$lld : %6$@
en: %@, round %lld of %lld, exercise %lld of %lld: %@

# %lld %% de la référence · repos conseillé %lld min
source: %1$lld %% de la référence · repos conseillé %2$lld min
en: %lld %% of the reference · suggested rest %lld min

# %lld %% du 1RM estimé (%lld série(s))
source: %1$lld %% du 1RM estimé (%2$lld série(s))
en: %lld %% of estimated 1RM (%lld set(s))

# %lld -> %lld répétitions
source: %1$lld -> %2$lld répétitions
en: %lld -> %lld repetitions

# %lld créé(s), %lld mis à jour, %lld retiré(s), %lld échec(s).
source: %1$lld créé(s), %2$lld mis à jour, %3$lld retiré(s), %4$lld échec(s).
en: %lld created, %lld updated, %lld removed, %lld failed.

source: %lld exercice
en: %lld exercise

# %lld exercice%@
source: %1$lld exercice%2$@
en: %lld exercise%@

source: %lld exercice(s)
en: %lld exercise(s)

source: %lld exercices
en: %lld exercises

source: %lld exercices sélectionnés
en: %lld exercises selected

# %lld h %@
source: %1$lld h %2$@
en: %lld h %@

# %lld jour(s) actif(s) sur la période, total %@%@, maximum le %@.
source: %1$lld jour(s) actif(s) sur la période, total %2$@%3$@, maximum le %4$@.
en: %lld active day(s) over the period, total %@%@, highest on %@.

source: %lld modèle(s)
en: %lld template(s)

source: %lld objectif(s)
en: %lld goal(s)

source: %lld paires
en: %lld pairs

# %lld photo(s), %@ sur l’appareil.
source: %1$lld photo(s), %2$@ sur l’appareil.
en: %lld photo(s), %@ on this device.

# %lld point(s), de %@ à %@ sur %@.
source: %1$lld point(s), de %2$@ à %3$@ sur %4$@.
en: %lld point(s), from %@ to %@ over %@.

source: %lld prescription(s) de programme
en: %lld program prescription(s)

# %lld record(s) battu(s) en %@ : %@. %lld exercice(s) chargé(s) pratiqué(s).
source: %1$lld record(s) battu(s) en %2$@ : %3$@. %4$lld exercice(s) chargé(s) pratiqué(s).
en: %lld record(s) beaten in %@: %@. %lld loaded exercise(s) trained.

source: %lld record(s) repris du doublon, car meilleurs.
en: %lld record(s) taken from the duplicate because they were better.

source: %lld répétitions
en: %lld repetitions

source: %lld s entre exercices
en: %lld s between exercises

source: %lld semaines
en: %lld weeks

source: %1$lld semaines analysées, %2$lld séries de travail, %3$@. Dernière semaine : %4$lld séries, %5$lld séance(s).
en: %lld weeks analysed, %lld working sets, %@. Last week: %lld sets, %lld workout(s).

source: %lld séance
en: %lld workout

# %lld séance%@ cette semaine
source: %1$lld séance%2$@ cette semaine
en: %lld workout%@ this week

source: %1$lld séance(s) ajoutée(s), %2$lld retirée(s), %3$lld déjà présente(s), %4$lld mesure(s) importée(s).
en: %lld workout(s) added, %lld removed, %lld already there, %lld measurement(s) imported.

source: %lld séance(s) créée(s).
en: %lld session(s) created.

source: %lld séance(s) sans valeur exploitable pour cet indicateur : elles sont absentes de la courbe plutôt qu'affichées à zéro.
en: %lld workout(s) with no usable value for this metric: they are missing from the curve rather than shown as zero.

# %lld séance(s) sur %@. Semaines consécutives avec au moins une séance : %lld.
source: %1$lld séance(s) sur %2$@. Semaines consécutives avec au moins une séance : %3$lld.
en: %lld workout(s) over %@. Consecutive weeks with at least one workout: %lld.

# %lld séance(s) · dernière le %@
source: %1$lld séance(s) · dernière le %2$@
en: %lld session(s) · last on %@

source: %1$lld séance(s), %2$lld programme(s) et %3$lld record(s) restaurés. Une sauvegarde de sécurité de l’état précédent a été créée sur cet appareil.
en: %lld workout(s), %lld program(s) and %lld record(s) restored. A safety backup of the previous state was created on this device.

# %lld séance(s), %lld série(s)
source: %1$lld séance(s), %2$lld série(s)
en: %lld workout(s), %lld set(s)

# %lld séance(s), %lld série(s) de travail, %@.
source: %1$lld séance(s), %2$lld série(s) de travail, %3$@.
en: %lld workout(s), %lld working set(s), %@.

source: %lld séances
en: %lld workouts

source: %lld séances par semaine
en: %lld workouts per week

source: %lld série(s) non mesurables
en: %lld set(s) not measurable

source: %lld série(s) prévue(s) ne seront pas faites.
en: %lld planned set(s) will not be done.

source: %lld série(s) sans charge effective connue ne sont pas comptées.
en: %lld set(s) with no known effective load are not counted.

source: %lld série(s) sans poids de corps connu : exclue(s) des moyennes plutôt que comptée(s) à zéro.
en: %lld set(s) without a known body weight: left out of the averages rather than counted as zero.

source: %lld série(s) sans poids de corps connu : leur tonnage n'est pas comptabilisé. Renseignez votre poids dans le profil pour les inclure.
en: %lld set(s) with no known bodyweight: their tonnage is not counted. Enter your weight in the profile to include them.

# %lld série(s) sur %lld séance(s)
source: %1$lld série(s) sur %2$lld séance(s)
en: %lld set(s) across %lld workout(s)

source: %lld séries
en: %lld sets

source: %lld séries par semaine
en: %lld sets per week

# %lld séries · %@
source: %1$lld séries · %2$@
en: %lld sets · %@

source: %1$lld séries · %2$lld reps au total. Glissez pour supprimer, maintenez pour déplacer.
en: %lld sets · %lld reps in total. Swipe to delete, hold to move.

source: %lld tours
en: %lld rounds

# %lld x %@ - repos %lld s
source: %1$lld x %2$@ - repos %3$lld s
en: %lld x %@ - rest %lld s

# %lld x %@ reps
source: %1$lld x %2$@ reps
en: %lld x %@ reps

# %lld x %lld %% max reps - repos %lld s
source: %1$lld x %2$lld %% max reps - repos %3$lld s
en: %lld x %lld %% max reps - rest %lld s

# %lld-%lld x %lld
source: %1$lld-%2$lld x %3$lld
en: %lld-%lld x %lld

source: + %lld exercice(s)
en: + %lld exercise(s)

source: -%@ d'aide
en: -%@ of assistance

source: 1 exercice sélectionné · sélectionnez-en un second pour créer un groupe
en: 1 exercise selected · select a second one to create a group

source: 12 semaines
en: 12 weeks

source: 1RM connu
en: Known 1RM

source: 1RM de référence
en: Reference 1RM

source: 1RM de référence pour %1$@ : %2$@, enregistré le %3$@. Aucune estimation dans l’historique.
en: Reference 1RM for %@: %@, recorded on %@. No estimate in your history.

source: 1RM estimé
en: Estimated 1RM

source: 1RM estimé (%@)
en: Estimated 1RM (%@)

source: 1RM estimé (kg)
en: Estimated 1RM (kg)

source: 1RM estimé : %@
en: Estimated 1RM: %@

source: 1RM estimé : %@ kg
en: Estimated 1RM: %@ kg

source: 1RM estimé jusqu’à %lld répétitions
en: Estimated 1RM up to %lld reps

# 1RM estimé pour %@ : %@, le %@.
source: 1RM estimé pour %1$@ : %2$@, le %3$@.
en: Estimated 1RM for %@: %@, on %@.

# 1RM estimé pour %@ : %@, le %@. 1RM de référence : %@, enregistré le %@.
source: 1RM estimé pour %1$@ : %2$@, le %3$@. 1RM de référence : %4$@, enregistré le %5$@.
en: Estimated 1RM for %@: %@, on %@. Reference 1RM: %@, recorded on %@.

source: 4 semaines
en: 4 weeks

source: 7 jours ? 6 jours + 1 repos est préférable.
en: 7 days? 6 days + 1 rest day is better.

source: Abandonner
en: Give up

source: Abandonner la séance
en: Discard workout

source: Abandonner les corrections ?
en: Discard corrections?

source: Abandonner « %1$@ » ? Les %2$lld série(s) enregistrée(s) seront supprimées et rien ne sera ajouté à l’historique.
en: Discard “%@”? The %lld logged set(s) will be deleted and nothing will be added to your history.

source: Accueil
en: Home

source: Accès refusé. Vous pouvez le modifier dans Réglages → Confidentialité → Santé.
en: Access denied. You can change it in Settings → Privacy → Health.

source: Actif
en: Active

source: Activation maxi : %lld reps
en: Top activation: %lld reps

source: Activation mini : %lld reps
en: Minimum activation: %lld reps

source: Activer
en: Turn on

source: Activer le coach IA
en: Turn on the AI coach

source: Activez ou créez un programme pour lancer une séance.
en: Activate or create a program to start a workout.

source: Activées
en: On

# Adhérence au planning : %lld/%lld séances prévues (%lld %%).
source: Adhérence au planning : %1$lld/%2$lld séances prévues (%3$lld %%).
en: Schedule adherence: %lld/%lld planned workouts (%lld %%).

source: Adresse du service
en: Service address

source: Affiche la fiche d’un exercice dans Muscu.
en: Shows an exercise sheet in Muscu.

source: Affiche un programme dans Muscu.
en: Shows a program in Muscu.

source: Afficher le résumé de la semaine
en: Show the week summary

source: Afficher les modèles archivés
en: Show archived templates

source: Ajout en cours…
en: Adding…

source: Ajoute ce qui manque sans toucher à vos données actuelles. Réimporter deux fois le même fichier ne crée aucun doublon.
en: Adds what is missing without touching your current data. Importing the same file twice creates no duplicate.

source: Ajoute ton premier exercice : les séries se saisissent comme d’habitude.
en: Add your first exercise: sets are logged as usual.

source: Ajoute trente secondes au repos en cours.
en: Adds thirty seconds to the current rest.

source: Ajoute un autre exercice ou termine la séance.
en: Add another exercise or finish the workout.

source: Ajoute une mesure de poids corporel.
en: Adds a bodyweight measurement.

source: Ajouter
en: Add

source: Ajouter au planning
en: Add to the schedule

source: Ajouter aux favoris
en: Add to favourites

source: Ajouter mon lien de démonstration
en: Add my demo link

source: Ajouter un exercice
en: Add an exercise

source: Ajouter un matériel
en: Add equipment

source: Ajouter un palier
en: Add a step

source: Ajouter un tour
en: Add a round

source: Ajouter une photo
en: Add a photo

source: Ajouter une séance
en: Add a workout

source: Ajouter une série
en: Add a set

source: Ajoutez au moins un palier.
en: Add at least one step.

source: Ajoutez une première valeur pour suivre son évolution.
en: Add a first value to follow how it changes.

source: Ajouté : %@
en: Added: %@

# Ajouté : %@ (%lld séries)
source: Ajouté : %1$@ (%2$lld séries)
en: Added: %@ (%lld sets)

source: Analyser
en: Analyse

source: Annuler
en: Cancel

source: Annuler cette adaptation
en: Undo this adaptation

source: Annuler la sélection
en: Clear the selection

source: Aperçu
en: Preview

source: Aperçu de la séance
en: Workout preview

source: Appliquer
en: Apply

source: Appliquer à
en: Apply to

source: Appliquer à cette séance
en: Apply to this workout

source: Appliquer à un programme
en: Apply to a program

source: Approche
en: Approach

source: Appuyez longuement sur un exercice pour le sélectionner et créer un superset ou un circuit.
en: Touch and hold an exercise to select it and create a superset or a circuit.

source: Archiver
en: Archive

source: Archivé
en: Archived

# Arrondis au palier chargeable le plus proche (%@ %@).
source: Arrondis au palier chargeable le plus proche (%1$@ %2$@).
en: Rounded to the nearest loadable step (%@ %@).

source: Arrêter
en: Stop

source: Assisté
en: Assisted

source: Au plus une fois par jour, au passage en arrière-plan ou après une séance terminée, l’export complet de vos données est écrit dans l’app Fichiers (Sur mon iPhone › Muscu › Sauvegardes). Les %lld plus récentes sont conservées. Les photos de progression n’y figurent pas, comme dans l’export.
en: At most once a day, when the app goes to the background or after a finished workout, the full export of your data is written to the Files app (On My iPhone › Muscu › Sauvegardes). The %lld most recent are kept. Progress photos are not included, as in the export.

source: Au-delà de %lld répétitions, l’estimation n’est plus fiable (réglage du plafond).
en: Beyond %lld reps the estimate is no longer reliable (cap setting).

source: Aucun
en: None

source: Aucun 1RM connu
en: No known 1RM

source: Aucun 1RM connu pour %@ : ni estimation dans l’historique, ni valeur de référence.
en: No known 1RM for %@: no estimate in your history and no reference value.

source: Aucun disque disponible : seule la barre est chargeable.
en: No plates available: only the bar can be loaded.

source: Aucun doublon détecté
en: No duplicates found

source: Aucun exercice compatible trouvé pour cette séance.
en: No compatible exercise found for this workout.

source: Aucun exercice exclu.
en: No excluded exercise.

source: Aucun exercice ne correspond aux filtres actifs.
en: No exercise matches the active filters.

source: Aucun exercice ne correspond à « %@ ». La recherche ignore les accents et tolère une faute simple.
en: No exercise matches “%@”. The search ignores accents and tolerates a single typo.

source: Aucun historique
en: No history

source: Aucun lieu. Sans lieu déclaré, aucun exercice n’est masqué.
en: No place. With no place declared, no exercise is hidden.

source: Aucun matériel déclaré : tous les exercices restent proposés.
en: No equipment declared: every exercise is still offered.

source: Aucun modèle.
en: No template.

source: Aucun muscle identifié sur la période.
en: No muscle identified over the period.

source: Aucun objectif
en: No goal

source: Aucun palier configuré pour cette pyramide
en: No step configured for this pyramid

source: Aucun profil
en: No profile

source: Aucun programme
en: No program

source: Aucun programme actif
en: No active program

source: Aucun programme n’est encore créé.
en: No program has been created yet.

source: Aucun rappel n’est programmé sans votre autorisation. Muscu fonctionne entièrement sans notifications.
en: No reminder is scheduled without your permission. Muscu works entirely without notifications.

source: Aucun record
en: No record

# Aucun record battu en %@, %lld exercice(s) chargé(s) pratiqué(s).
source: Aucun record battu en %1$@, %2$lld exercice(s) chargé(s) pratiqué(s).
en: No record beaten in %@, %lld loaded exercise(s) trained.

source: Aucun record récent
en: No recent records

source: Aucun record sur les %lld derniers jours.
en: No records in the last %lld days.

source: Aucun remplacement proposé ici. Vous pouvez choisir librement un exercice.
en: No replacement suggested here. You are free to pick any exercise.

source: Aucun événement enregistré. C’est le cas normal.
en: No event recorded. That is the normal case.

source: Aucune
en: None

source: Aucune adaptation
en: No adaptation

source: Aucune autorisation demandée pour l’instant.
en: No permission requested so far.

source: Aucune base locale n’a été trouvée sur cet appareil.
en: No local database was found on this device.

source: Aucune charge prescrite : la décharge ne s’applique pas ici.
en: No load prescribed: the deload does not apply here.

source: Aucune collection.
en: No collection.

source: Aucune demande enregistrée.
en: No request recorded.

source: Aucune donnée
en: No data

source: Aucune donnée de %@ sur la période.
en: No %@ data over the period.

source: Aucune donnée à supprimer.
en: No data to delete.

source: Aucune ligne en quarantaine.
en: No quarantined row.

source: Aucune limite
en: No limit

source: Aucune mesure
en: No measurement

source: Aucune photo.
en: No photo.

source: Aucune récurrence. Ajoutez-en une pour planifier une semaine type.
en: No recurrence. Add one to plan a typical week.

source: Aucune référence connue pour « %@ ». Enregistrez d’abord quelques séries : l’estimation issue de vos performances sert de base au protocole.
en: No known reference for “%@”. Record a few sets first: the estimate drawn from your performances is the basis of the protocol.

source: Aucune sauvegarde pour l’instant.
en: No backup yet.

source: Aucune semaine sur la période.
en: No week over the period.

source: Aucune semaine à venir.
en: No upcoming week.

source: Aucune stagnation détectée sur les exercices de vos programmes.
en: No stagnation detected on the exercises of your programs.

source: Aucune séance
en: No workout

source: Aucune séance enregistrée : il n’y a encore rien à comparer.
en: No workout recorded: there is nothing to compare yet.

source: Aucune séance n’est en cours.
en: No workout is in progress.

source: Aucune séance planifiée sur la période : l'adhérence n'est pas calculable.
en: No workout planned over the period: adherence cannot be computed.

source: Aucune séance planifiée sur la période.
en: No workout planned over the period.

source: Aucune séance sur les sept derniers jours.
en: No workout in the last seven days.

source: Aucune séance, mesure, donnée de santé ni clé d’API n’y figure.
en: No workout, measurement, health data or API key appears in it.

source: Aucune série chargée ce mois-ci.
en: No loaded set this month.

source: Aucune série chargée en %@.
en: No loaded set in %@.

source: Aucune série enregistrée pour l’instant.
en: No sets logged yet.

source: Aucune série n’est enregistrée : il n’y a rien à terminer. Vous pouvez abandonner la séance.
en: No set has been logged, so there is nothing to finish. You can discard the workout instead.

source: Aucune série éligible
en: No eligible set

source: Aucune tendance sur tout l’historique : il n’y a pas de période précédente à comparer.
en: No trend over the whole history: there is no previous period to compare with.

source: Aucune tentative validée : rien ne sera enregistré.
en: No attempt validated: nothing will be recorded.

source: Aucune valeur enregistrée.
en: No value recorded.

source: Aucune valeur exploitable pour cet exercice sur la période.
en: No usable value for this exercise over the period.

source: Augmenter la charge
en: Increase load

source: Augmenter la distance
en: Increase distance

source: Augmenter le poids
en: Increase the weight

source: Augmenter les répétitions
en: Increase the repetitions

source: Aujourd’hui
en: Today

source: Automatique
en: Automatic

source: Autorisation
en: Permission

source: Autoriser l’accès au calendrier
en: Allow calendar access

source: Autorisé
en: Allowed

source: Autre disque (%@)
en: Other plate (%@)

source: Avancement
en: Progress

source: Avancé
en: Advanced

source: Avant de commencer
en: Before you start

source: Avant la séance
en: Before the workout

source: Avant la séance : %lld min
en: Before the workout: %lld min

source: Barre
en: Bar

source: Barre : meilleure charge effective du mois ÷ record historique de l’exercice, séries de travail à charge réellement portée. Un record dépasse tout l’historique antérieur ; un premier essai n’en est pas un.
en: Bar: best effective load of the month ÷ all-time record for the exercise, working sets with an actually lifted load. A record beats all earlier history; a first attempt is not one.

source: Barre par défaut
en: Default bar

source: Barre seule
en: Bar only

source: Bilatéral
en: Bilateral

source: Bloc terminé
en: Block finished

source: Brouillon
en: Draft

source: Cache utilisé
en: Cache used

source: Calculateur de 1RM
en: 1RM calculator

source: Calendrier
en: Calendar

source: Catégorie
en: Category

# Catégories partagées : %@ %@
source: Catégories partagées : %1$@ %2$@
en: Shared categories: %@ %@

source: Ce ne sont pas des doublons
en: These are not duplicates

source: Ce plan ne conserve pas son style de périodisation : les volumes et intensités des semaines à venir sont laissés tels quels, seules les dates sont réalignées.
en: This plan does not keep its periodization style: the volumes and intensities of the upcoming weeks are left as they are, only the dates are realigned.

source: Ce que Muscu partagera
en: What Muscu will share

source: Ce que contient le journal
en: What the journal contains

source: Ce qui se passera
en: What will happen

source: Ce qui sera envoyé :
en: What will be sent:

source: Ces deux valeurs pilotent les charges en pourcentage. Vous pouvez les corriger à la main.
en: These two values drive the percentage-based loads. You can correct them by hand.

source: Ces réglages sont facultatifs. « Automatique » déduit le type de charge du catalogue.
en: These settings are optional. “Automatic” infers the load type from the catalogue.

source: Ces zones filtrent la sélection d'exercices. Ce n'est pas un avis médical : en cas de douleur ou de blessure, consultez un professionnel de santé.
en: These areas filter exercise selection. This is not medical advice: if you are in pain or injured, see a health professional.

source: Cet objectif n'est pas exploitable sur cet appareil.
en: This goal cannot be used on this device.

source: Cette fusion créerait une boucle : l’exercice conservé est lui-même redirigé vers le doublon.
en: This merge would create a loop: the kept exercise is itself redirected to the duplicate.

source: Cette image n’a pas pu être lue.
en: This image could not be read.

source: Cette semaine
en: This week

source: Changer d’exercice
en: Change exercise

source: Chaque exercice peut définir sa propre règle. Une proposition n'est jamais appliquée sans votre accord.
en: Each exercise can set its own rule. A suggestion is never applied without your agreement.

source: Chaque palier part de la charge du palier précédent. Un repos de 0 s est normal sur ce format.
en: Each step starts from the load of the previous one. A rest of 0 s is normal in this format.

source: Chaque proposition s'appuie sur vos séances précédentes. Elle reste annulable depuis le journal d'adaptation.
en: Every suggestion is based on your previous workouts. It stays reversible from the adaptation journal.

source: Charge
en: Load

source: Charge (facultatif)
en: Load (optional)

source: Charge externe
en: External load

source: Charge impossible avec vos disques
en: Load not possible with your plates

source: Charge maximale
en: Maximum load

source: Charge maximale · %@
en: Maximum load · %@

source: Charge moyenne
en: Average load

source: Charge visée
en: Target load

source: Charges disponibles
en: Available loads

source: Charges minimale, maximale et incrément servent à proposer des charges réellement disponibles ici.
en: Minimum load, maximum load and increment are used to suggest loads that are really available here.

source: Check-in de forme
en: Readiness check-in

source: Chevauchements
en: Overlaps

source: Choisir la source
en: Choose the source

source: Choisir les nouvelles données
en: Choose the new data

source: Choisir un autre exercice
en: Choose another exercise

source: Choisir un exercice
en: Choose an exercise
